{
  "_class_name": "VQModel",
  "_diffusers_version": "0.8.0.dev0",
  "_name_or_path": "/home/suraj_huggingface_co/.cache/huggingface/diffusers/models--duongna--ldm-super-resolution/snapshots/e2e5fa6236896eb4dcc1d117dde23114542dde7d/vqvae",
  "act_fn": "silu",
  "block_out_channels": [
    128,
    256,
    512
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "in_channels": 3,
  "latent_channels": 3,
  "layers_per_block": 2,
  "norm_num_groups": 32,
  "num_vq_embeddings": 8192,
  "out_channels": 3,
  "sample_size": 256,
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ],
  "vq_embed_dim": null
}
